<?php

return [
    'areas' => [
        'AZQQ' => '安卓QQ',
        'AZVX' => '安卓微信',
        'IOSQQ' => '苹果QQ',
        'IOSVX' => '苹果微信',
    ],
    'maps' => [
        'DS' => [
            'name'=>'王者荣耀_大师魔女',
            'pre' => 'WZ',
            'jiaji' => 'WZRY' //加急标记
        ],
        'JY' => [
            'name' => '王者荣耀_精英魔女',
            'pre' => 'WZ',
            'jiaji' => 'WZRY' //加急标记
        ],
        'QQFC' => [
            'name' => 'QQ飞车_金币/经验',
            'pre' => 'FC',
            'jiaji' => 'FC' //加急标记
        ],
    ],
    'modes' => [
        '关闭','模式一','模式二','模式三'
    ],
    'statuss' => [
        '0' => '正常刷完',
        '1' => '排队等待',
        '2' => '正在登陆',
        '3' => '正常挂机',
        '4' => '健康系统',
        '5' => '成功登陆',
        '6' => '领取奖励',
        '13' => '选择好友',
        '12' => '微信二维码',
        '11' => '手机验证码',
        '-1' => '手动停挂',
        '-2' => '密码错误',
        '-3' => '地图未过',
        '-4' => '防沉迷',
        '-5' => '账号冻结',
        '-6' => '未关闭登陆保护',
        '-7' => '新号',
        '-8' => '授权超时',
        '-9' => '刷图限制',
        '21' => '内部错误',
        '-20' => '验证失败',
        '-21' => '点数不足',
        '-10' => '区不存在',
        '-11' => '抢先服不能刷',
        '22' => '更换设备挂机'
    ],
    'prices' => [
        'AZVXWZ' => 5, //安卓微信
        'AZQQWZ' => 4, //安卓QQ
        'IOSVXWZ' => 5, //IOS微信
        'IOSQQWZ' => 4, //IOSQQ

        'AZVXFC' => 18, //安卓微信 飞车
        'AZQQFC' => 15, //安卓QQ 飞车
        'IOSVXFC' => 18, //IOS微信 飞车
        'IOSQQFC' => 15, //IOSQQ 飞车
    ],
    'remarks' => "<br>".'王者荣耀：安卓QQ：4点/次，苹果QQ：4点/次，安卓微信：5点/次，苹果微信：5点/次，'
        ."<br>".'QQ飞车：安卓QQ：15点/次，苹果QQ：15点/次，安卓微信：18点/次，苹果微信：18点/次',


];
